## Load data into DataFrame

In [2]:
import pandas as pd

In [16]:
file_path = 'datasets/shopping_data.csv'
df_shopping = pd.read_csv(file_path, encoding='ISO-8859-1')
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

- What knowledge do we hope to glean from running an unsupervised learning model on this dataset?
- What data is available? What type? What is missing? What can be removed?
- Is the data in a format that can be passed into an unsupervised learning model?
- Can I quickly hand off this data for others to use?

## Data Selection

In [17]:
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [18]:
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [19]:
df_shopping.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203 entries, 0 to 202
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              203 non-null    int64
 1   Card Member             201 non-null    object
 2   Age                     201 non-null    float64
 3   Annual Income           203 non-null    int64
 4   Spending Score (1-100)  202 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 8.1+ KB

In [20]:
# find null values
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null values")

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

In [21]:
# Drop null rows
df_shopping = df_shopping.dropna()

In [22]:
# Find duplicate entries
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

In [23]:
# Remove CustomerID column
df_shopping.drop(columns=['CustomerID'], inplace=True)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

**To prepare data for ML model:**
- Null values must be handled
- Only numeric data is used
- Values are scaled i.e. data has been manipulated to ensure the variance between the numbers won't skew the results

In [24]:
# transform string column
df_shopping.loc[:,"Card Member"] = df_shopping.loc[:,"Card Member"].map(lambda x: 1 if x=="Yes" else 0)
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [27]:
# scale Annual Income column
df_shopping.loc[:,"Annual Income"] = df_shopping.loc[:,"Annual Income"].map(lambda x: x / 1000)

In [28]:
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [29]:
columns = ['Card_Member','Age','Annual_Income','Spending_Score']
df_shopping.columns = columns

In [30]:
df_shopping.head()

   Card_Member   Age  Annual_Income  Spending_Score
0            1  19.0           15.0            39.0
1            1  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [31]:
# Save cleaned data
file_path = "datasets/shopping_data_cleaned.csv"
df_shopping.to_csv(file_path, index=False)